Add/Remove a columns and rows

Demo data

In [164]:
import pandas as pd

In [165]:
people = {
    'first': ['Corey', 'Jane', 'John'], 
    'last': ['Schafer', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [166]:
df= pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

append a columns

In [167]:
# way first 
# add columns
# it want value of all the rows
df["full name"]=["yash jain","sol","sdf"]
df

   first     last                    email  full name
0  Corey  Schafer  CoreyMSchafer@gmail.com  yash jain
1   Jane      Doe        JaneDoe@email.com        sol
2   John      Doe        JohnDoe@email.com        sdf

In [168]:
df['full_name'] = df['first'] + ' ' + df['last']
df

   first     last                    email  full name      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  yash jain  Corey Schafer
1   Jane      Doe        JaneDoe@email.com        sol       Jane Doe
2   John      Doe        JohnDoe@email.com        sdf       John Doe

In [169]:
# remove the columns for the data set
df.drop(columns=["full name"], inplace=True)
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [170]:
df[["full","name"]]=(df["full_name"].str.split(" ",expand=True))
df

   first     last                    email      full_name   full     name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe   Jane      Doe
2   John      Doe        JohnDoe@email.com       John Doe   John      Doe

append the rows

In [171]:
df.loc[len(df)]={'full': 'Tony',"name":["yash","jain"]}
df

   first     last                    email      full_name   full          name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer  Corey       Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe   Jane           Doe
2   John      Doe        JohnDoe@email.com       John Doe   John           Doe
3    NaN      NaN                      NaN            NaN   Tony  [yash, jain]

way 2 for append the rows 
append() function not work bc the function is disable

In [172]:


# Append a new row
df = pd.concat([df, pd.DataFrame([{'first': 'Tony'}])], ignore_index=True)

print(df)

   first     last                    email      full_name   full          name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer  Corey       Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe   Jane           Doe
2   John      Doe        JohnDoe@email.com       John Doe   John           Doe
3    NaN      NaN                      NaN            NaN   Tony  [yash, jain]
4   Tony      NaN                      NaN            NaN    NaN           NaN

In [176]:
filt = (df['last'] == 'Doe'.index)
df.drop(index=df[filt].index)

   first     last                    email      full_name   full          name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer  Corey       Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe   Jane           Doe
2   John      Doe        JohnDoe@email.com       John Doe   John           Doe
3    NaN      NaN                      NaN            NaN   Tony  [yash, jain]
4   Tony      NaN                      NaN            NaN    NaN           NaN